In [9]:
"""Import libraries for make some calculations with data and understand data."""
import pandas as pd
import numpy as np

In [2]:
"""With pandas library read csv file for importing python."""
df = pd.read_csv('titanic.csv')

In [3]:
"""Show first 5 row in dataframe."""
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
"""With for loop you can print out in name column first ten value."""
for i in df["Name"][:10]:
    print(i)

Braund, Mr. Owen Harris
Cumings, Mrs. John Bradley (Florence Briggs Thayer)
Heikkinen, Miss. Laina
Futrelle, Mrs. Jacques Heath (Lily May Peel)
Allen, Mr. William Henry
Moran, Mr. James
McCarthy, Mr. Timothy J
Palsson, Master. Gosta Leonard
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Nasser, Mrs. Nicholas (Adele Achem)

In [6]:
"""With for loop you can print out in name column first ten value with uppercase."""
for i in df["Name"][:10]:
    print(i.upper())

BRAUND, MR. OWEN HARRIS
CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)
HEIKKINEN, MISS. LAINA
FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
ALLEN, MR. WILLIAM HENRY
MORAN, MR. JAMES
MCCARTHY, MR. TIMOTHY J
PALSSON, MASTER. GOSTA LEONARD
JOHNSON, MRS. OSCAR W (ELISABETH VILHELMINA BERG)
NASSER, MRS. NICHOLAS (ADELE ACHEM)

# Unit dataframes with concat

In [14]:
"""Enter the values with create dictionary"""
data_a = {"id" :["1","2","3"],
         "isim" :["Furkan","Umut","Mazlum"],
         "soyisim" :["Colhak","Dogan","Baba"]}
data_b = {"id" :["4","5","6"],
         "isim" :["Ahmet","Mehmet","Kerim"],
         "soyisim" :["Bayram","Elmas","Alıcı"]}

In [15]:
"""Create a dataframe with dictionary"""
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)

In [18]:
""" unite these two seperate dataframes"""
pd.concat([df_a,df_b],axis=0)

  id    isim soyisim
0  1  Furkan  Colhak
1  2    Umut   Dogan
2  3  Mazlum    Baba
0  4   Ahmet  Bayram
1  5  Mehmet   Elmas
2  6   Kerim   Alıcı

In [19]:
""" unite these two seperate dataframes with colummn"""
pd.concat([df_a,df_b],axis=1)

  id    isim soyisim id    isim soyisim
0  1  Furkan  Colhak  4   Ahmet  Bayram
1  2    Umut   Dogan  5  Mehmet   Elmas
2  3  Mazlum    Baba  6   Kerim   Alıcı

# Unit dataframes with merge

In [20]:
data_a = {"id" :["1","2","3","4"],
         "isim" :["Furkan","Umut","Mazlum","Ferdi"]
         }
data_b = {"id" :["3","4","5","6"],
         "satis" :["5554","2342","6689","8759"]}

In [21]:
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)

In [22]:
"""If you merge these dataframes It is going to take overlapping values as id 3,4."""
pd.merge(df_a,df_b)

  id    isim satis
0  3  Mazlum  5554
1  4   Ferdi  2342

In [35]:
"""With how command you can choose two of them and make dataframe with certain dictionary"""
pd.merge(df_a,df_b, on="id", how="left")

  id    isim satis
0  1  Furkan   NaN
1  2    Umut   NaN
2  3  Mazlum  5554
3  4   Ferdi  2342

In [34]:
pd.merge(df_a,df_b, on="id", how="right")

  id    isim satis
0  3  Mazlum  5554
1  4   Ferdi  2342
2  5     NaN  6689
3  6     NaN  8759